<template>
  <!-- MAin footer -->
  <footer class="main-footer">
    <div class="container-fluid">
      <div class="row">
        <div class="col-12">
          <form class="footer-subscribe">
            <div class="footer-subscribe__ico">
              <svg width="70" height="83" viewBox="0 0 70 83" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path
                        d="M36 70V69H35C16.0555 69 1 53.7808 1 35C1 16.2223 16.2223 1 35 1C53.7777 1 69 16.2223 69 35C69 46.82 60.5189 58.442 51.7904 67.2329C47.4542 71.6 43.1143 75.2119 39.8568 77.7326C38.2705 78.96 36.9429 79.9273 36 80.5954V70Z"
                        stroke="#2A60EC" stroke-width="2"/>
                <path fill-rule="evenodd" clip-rule="evenodd"
                      d="M47 47H25C23.8954 47 23 46.1046 23 45V28C23 27.875 36 20 36 20C36 20 49 27.986 49 28V45C49 46.1046 48.1046 47 47 47ZM47 31.256L37.71 37.5L47 43.741V31.256ZM36 38.647L26.545 45H45.455L36 38.647ZM25 43.741L34.29 37.5L25 31.256V43.741ZM36 22L25 29V29.071L25.052 28.993L36 36.349L46.949 28.993L47 29.071V29L36 22Z"
                      fill="#2A60EC"/>
              </svg>
            </div>
            <div class="footer-subscribe__text">
              Будьте в курсе самых интересных предложений!
            </div>
            <input type="email" placeholder="Введите ваш e-mail:">
            <button type="submit" class="btn btn--default">Подписаться</button>
          </form>
        </div>
      </div>
    </div>
    <div class="container-fluid main-footer__inner">
      <div class="row">
        <div class="main-footer-subscribe d-none">
          <div class="main-footer-subscribe__head">
            <img src="/assets/img/svg/subscribe.svg">
            Будьте в курсе самых интересных предложений!
          </div>
          <form class="main-footer-subscribe__form">
            <input type="email" placeholder="Введите ваш e-mail:">
            <button type="submit" class="btn btn--default">
              Подписаться
            </button>
          </form>
        </div>
        <div class="main-footer__contacts-wrap col-12 col-xl-4">
          <svg width="125" height="66" viewBox="0 0 125 66" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path opacity="0.8" fill-rule="evenodd" clip-rule="evenodd"
                  d="M121.764 19.032C120.451 19.032 119.386 17.9674 119.386 16.6542C119.386 15.341 120.451 14.2764 121.764 14.2764C123.077 14.2764 124.142 15.341 124.142 16.6542C124.142 17.9674 123.077 19.032 121.764 19.032ZM120.02 20.9342C122.409 22.3878 119.386 27.1163 119.386 27.1163C119.386 27.1163 108.432 51.341 95.2914 59.1369C88.1798 63.3555 82.7038 65.8956 77.6959 64.8435C73.2475 63.909 61.3257 59.0952 61.9333 43.1742C61.4577 43.494 58.5569 45.3791 55.4392 45.9007C55.4721 45.843 55.5053 45.7829 55.5382 45.7245L55.0803 45.9536C55.2001 45.9378 55.3198 45.9208 55.4392 45.9007C45.9406 62.5975 39.2322 61.9453 37.1155 62.9413C32.4113 65.1548 27.2137 63.6454 23.2146 59.9065C23.233 59.8906 23.2514 59.8748 23.2698 59.8589L23.1802 59.874L23.2146 59.9057C18.9302 63.602 14.6629 65.576 11.5942 65.1605C9.27985 64.8471 -2.54792 65.3878 0.497987 35.3593C0.497987 35.3593 3.14967 20.2969 8.58237 10.9476C14.0151 1.59822 15.9736 0.308686 22.2149 0.0098804C28.4562 -0.288925 25.0582 6.28004 24.5926 7.4602C24.1271 8.64036 17.0182 22.42 14.606 31.8719C12.1939 41.3238 8.75135 53.9292 12.3868 57.0761C13.7908 58.2915 16.2326 56.718 18.7855 54.0763L18.811 53.8719C17.3289 50.8175 16.5425 47.4725 16.5082 44.0777C16.2353 19.8005 29.477 18.7598 32.677 19.8246C35.877 20.8893 44.2732 24.7996 35.0548 44.0777C33.2957 47.7564 31.1089 51.2148 28.5397 54.3813C28.5239 54.3576 28.508 54.3338 28.4922 54.3098L28.5053 54.4237C28.5167 54.4097 28.528 54.3954 28.5394 54.3813C28.9357 54.9852 29.3644 55.5673 29.8234 56.125C34.1373 61.3494 43.1547 53.9911 48.4411 44.5602L48.4154 44.329C44.0269 41.8878 39.068 36.1618 40.9199 22.0438C43.3574 3.4616 54.4097 0.119733 59.3079 1.27802C64.2061 2.43631 71.3235 12.6578 59.625 37.737C59.3926 38.2352 59.1619 38.7198 58.9321 39.1976C58.9113 39.2069 58.8901 39.2149 58.8687 39.2241L58.9115 39.2399C58.9181 39.2258 58.9248 39.2123 58.9316 39.1984C61.0897 38.2173 62.7953 36.1518 62.7953 36.1518L62.6739 37.2202C62.7138 37.023 62.752 36.8273 62.7953 36.6274C62.7953 36.6274 65.365 16.2245 76.4278 6.98464C87.4906 -2.25517 96.8139 0.074397 100.839 1.59505C103.96 2.77363 108.348 6.11946 108.29 14.5935C108.207 26.6121 99.6939 45.4727 76.0872 53.591L76.0684 53.6346C76.1808 54.041 76.2991 54.4482 76.4278 54.8569C77.38 57.8806 83.9693 58.4508 89.6481 55.3871C96.0962 51.9094 101.881 44.8281 103.534 42.9681C106.645 39.4696 115.18 25.1705 115.423 24.1045C115.666 23.0385 117.631 19.4806 120.02 20.9342ZM29.1896 29.9697C25.9258 29.4066 23.4781 37.4774 25.1279 45.8255L25.0691 45.9181L25.1836 46.1012C25.1644 46.0092 25.1462 45.9173 25.1279 45.8255C26.58 43.5456 27.6766 41.4869 28.08 40.2733C29.545 35.8665 32.0212 30.4581 29.1896 29.9697ZM53.9183 14.752C49.4409 15.2486 45.1786 31.0485 51.5672 37.3184C51.5496 37.3731 51.5339 37.4222 51.5171 37.4742L51.6484 37.3922C51.6219 37.367 51.5934 37.3447 51.5672 37.3184C53.2061 32.2193 58.9909 14.1894 53.9183 14.752ZM89.7433 35.0422C98.5376 22.5407 95.3489 16.3586 92.2795 15.7031C91.2799 15.4896 88.4523 15.6223 85.3533 18.6426C79.857 23.9996 73.5745 35.144 75.0154 48.1733C75.039 48.1892 75.0615 48.2025 75.0833 48.2161C76.6624 47.3563 81.8502 46.2626 89.7433 35.0422Z"
                  fill="#202020"/>
          </svg>
          <div class="main-footer__contacts">
            <a href="tel:+7 (499) 110-78-97">+7 (499) 110-78-97</a>
            <a href="mailto:info@qaqadu.ru">info@qaqadu.ru</a>
          </div>
          <div class="main-footer__copyright">
            Все данные, представленные на сайте, носят сугубо информационный характер и не являются публичной офертой,
            определяемой положениями пункта 2 статьи 437 Гражданского Кодекса Российской Федерации. Указанные цены
            являются рекомендованными и могут отличаться от действительных цен.
          </div>
          <div class="main-footer__payment">
            <img src="/assets/img/svg/visa.svg">
            <img src="/assets/img/svg/mastercard.svg">
          </div>

          <a href="http://netlab-com.ru" class="main-footer__netlab">
            Создание сайта - Студия NetLab
          </a>
        </div>

        <div class="main-footer__nav-wrap col-12 col-xl-8 d-none d-xl-block">
          <div class="row">
            <div class="col-4">
              <div class="main-footer__nav">
                <h4>Полезная информация</h4>
                <nav>
                  <ul>
                    <li><a href="#">Доставка и оплата</a></li>
                    <li><a href="#">Оформление заказа</a></li>
                    <li><a href="#">Часто задаваемые вопросы</a></li>
                    <li><a href="#">Сертификаты и лицензии</a></li>
                    <li><a href="#">Презентации и документы</a></li>
                    <li><a href="#">Прайс-листы</a></li>
                    <li><a href="#">Соглашение на обработку данных</a></li>
                    <li><a href="#">Политика конфидициальности</a></li>
                  </ul>
                </nav>
              </div>
            </div>

            <div class="col-4">
              <div class="main-footer__nav">
                <h4>Партнерка</h4>
                <nav>
                  <ul>
                    <li><a href="#">Покупателям</a></li>
                    <li><a href="#">Оптовикам</a></li>
                    <li><a href="#">Клубным покупателям</a></li>
                    <li><a href="#">Организаторам СП</a></li>
                    <li><a href="#">Наша команда</a></li>
                    <li><a href="#">Поставщикам</a></li>
                  </ul>
                </nav>
              </div>
            </div>

            <div class="col-4">
              <div class="main-footer__nav">
                <h4>Компания</h4>
                <nav>
                  <ul>
                    <li><a href="#">О компании</a></li>
                    <li><a href="#">Фотогалерея</a></li>
                    <li><a href="#">Отзывы</a></li>
                    <li><a href="#">Контакты</a></li>
                  </ul>
                </nav>
              </div>
            </div>
          </div>
        </div>

        <div class="main-footer__nav-wrap col-12 d-xl-none">
          <nav>
            <ul>
              <li><a href="#">Доставка и оплата</a></li>
              <li><a href="#">Оформление заказа</a></li>
              <li><a href="#">Покупателям</a></li>
              <li><a href="#">Оптовикам</a></li>
              <li><a href="#">Поставщикам</a></li>
              <li><a href="#">Клубным покупателям</a></li>
              <li><a href="#">О компании</a></li>
              <li><a href="#">Отзывы</a></li>
              <li><a href="#">Контакты</a></li>
            </ul>
          </nav>
        </div>
        <!-- <div class="col-12 d-sm-none order-3">
          <a href="http://netlab-com.ru" class="main-footer__netlab">
            Создание сайта - Студия NetLab
          </a>
        </div> -->
      </div>
    </div>
    <div class="main-footer__bottom">
      <div class="container-fluid">
        <div class="row">
          <div class="col-12">
            <a href="http://netlab-com.ru" class="main-footer__netlab">
              Создание сайта - Студия NetLab
            </a>
          </div>
        </div>
      </div>
    </div>
  </footer>
  <!-- End Main footer-->
</template>